{"0":{"publishedAt":"2022-05-03T23:24:09Z","title":"Leonard Ignelzi, renowned AP photographer, dies at 74","author":"ELLIOT SPAGAT and BERNIE WILSON Associated Press","content":"SAN DIEGO -- Leonard Ignelzi, whose knack for being in the right place at the right time produced breathtaking images of Hall of Fame sports figures, devastating wildfires and other major news over 3… [+4441 chars]"},"1":{"publishedAt":"2022-05-03T23:19:07Z","title":"50 Inspiring Teachers to be Honored during Disney World’s 50th Celebration","author":"Jessica Gunderson","content":"Most of us have one teacher we will never forget. The one that brought their classroom to life, sparking our minds and desire to learn like never before.\r\nTo coincide with the 50th Anniversary celebr… [+2055 chars]"},"2":{"publishedAt":"2022-05-03T23:13:52Z","title":"Missouri man executed for killing couple in 1996 becomes just the 5th person to be put to death in the US this year","author":"The Associated Press","content":"BONNE TERRE, Mo. -- Missouri man executed for killing couple in 1996 becomes just the 5th person to be put to death in the US this year."},"3":{"publishedAt":"2022-05-03T22:36:42Z","title":"Prosecutors charge 3 with murder in Sacramento mass shooting","author":"KATHLEEN RONAYNE and STEFANIE DAZIO Associated Press","content":"SACRAMENTO, Calif. -- Prosecutors have filed murder charges in a mass shooting that rocked Californias capital city a month ago.\r\nDistrict Attorney Anne Marie Schubert said Tuesday that Smiley Martin… [+1411 chars]"},"4":{"publishedAt":"2022-05-03T22:16:56Z","title":"Escaped inmate, jail official had 'special relationship'","author":"The Associated Press","content":"FLORENCE, Ala. -- An escaped Alabama inmate had a special relationship with the jail official authorities believe assisted in his escape, a sheriff's office said Tuesday.\r\nA manhunt was underway for … [+3549 chars]"},"5":{"publishedAt":"2022-05-03T21:57:08Z","title":"Oklahoma governor signs 6-week abortion ban into law","author":"Mary Kekatos","content":"Oklahoma Gov. Kevin Stitt signed an abortion bill Tuesday that is modeled after a controversial Texas law.\r\nThe bill, formally known as S.B. 1503, creates the \"Oklahoma Heartbeat Act,\" which bans abo… [+3061 chars]"},"6":{"publishedAt":"2022-05-03T21:52:11Z","title":"Mom charged in kids' deaths could face death if convicted","author":"REBECCA BOONE Associated Press","content":"BOISE, Idaho -- Prosecutors in Idaho say they will seek the death penalty against a woman charged with killing her two youngest children and her new husband's previous wife.\r\nThe prosecuting attorney… [+2417 chars]"},"7":{"publishedAt":"2022-05-03T21:35:46Z","title":"Tulsa Race Massacre survivors lawsuit to move forward","author":"Kendall Ross, Steve Osunsami","content":"A judge in Oklahoma ruled Monday that a Tulsa Race Massacre reparations lawsuit may proceed. The decision by Tulsa County Judge Caroline Wall was welcome news to 107-year-old Viola Ford Fletcher and … [+3817 chars]"},"8":{"publishedAt":"2022-05-03T21:31:17Z","title":"Oklahoma governor signs Texas-style ban on most abortions","author":"SEAN MURPHY Associated Press","content":"OKLAHOMA CITY -- Oklahomas Republican Gov. Kevin Stitt signed a Texas-style abortion ban on Tuesday that prohibits abortions after about six weeks of pregnancy, part of a nationwide push in GOP-led s… [+3282 chars]"},"9":{"publishedAt":"2022-05-03T21:25:52Z","title":"Oklahoma governor signs Texas-style bill to ban abortions after about 6 weeks of pregnancy; lawsuit pending to halt it","author":"The Associated Press","content":"Oklahoma governor signs Texas-style bill to ban abortions after about 6 weeks of pregnancy; lawsuit pending to halt it"},"10":{"publishedAt":"2022-05-03T21:20:23Z","title":"Politico's Supreme Court scoop boosts security concerns","author":"DAVID BAUDER AP Media Writer","content":"NEW YORK -- In breaking news of a Supreme Court draft opinion that would strike down 50 years of abortion policy, Politico's most impactful moment also put the news organization squarely in the middl… [+4450 chars]"},"11":{"publishedAt":"2022-05-03T21:20:00Z","title":"CBS declares television season victory with weeks to go","author":"DAVID BAUDER AP Media Writer","content":"NEW YORK -- The traditional broadcast television season doesn't end until later this month, but that hasn't stopped CBS from declaring victory.\r\nCBS issued a statement on Tuesday saying it would end … [+2469 chars]"},"12":{"publishedAt":"2022-05-03T21:19:11Z","title":"CBS declares television season victory with weeks to go","author":"DAVID BAUDER AP Media Writer","content":"NEW YORK -- The traditional broadcast television season doesn't end until later this month, but that hasn't stopped CBS from declaring victory.\r\nCBS issued a statement on Tuesday saying it would end … [+2469 chars]"},"13":{"publishedAt":"2022-05-03T21:17:56Z","title":"Teen appeared to fall out of ride halfway through plunge","author":"MIKE SCHNEIDER Associated Press","content":"ORLANDO, Fla. -- A 14-year-old Missouri boy who fell to his death from a 430-foot (130-meter) drop-tower ride in central Florida's tourist district appeared to slip out of his seat at the halfway mar… [+2936 chars]"},"14":{"publishedAt":"2022-05-03T21:15:11Z","title":"Washington reaches $518M settlement with opioid distributors","author":"GENE JOHNSON Associated Press","content":"SEATTLE -- Months into a complex trial over their role in flooding Washington with highly addictive painkillers, the nation's three largest opioid distributors agreed Tuesday to pay the state $518 mi… [+4074 chars]"},"15":{"publishedAt":"2022-05-03T21:15:03Z","title":"Washington reaches $518M settlement with opioid distributors","author":"GENE JOHNSON Associated Press","content":"SEATTLE -- Months into a complex trial over their role in flooding Washington with highly addictive painkillers, the nation's three largest opioid distributors agreed Tuesday to pay the state $518 mi… [+4074 chars]"},"16":{"publishedAt":"2022-05-03T21:13:10Z","title":"Leaked court document galvanizes anti-abortion activists","author":"DAVID CRARY AP National Writer","content":"NEW YORK -- For veteran anti-abortion activists, the leaked Supreme Court document read like a detailed dream come true, spelling out a potential ruling that would overturn the landmark Roe v. Wade d… [+4896 chars]"},"17":{"publishedAt":"2022-05-03T21:11:41Z","title":"Man convicted in fatal stabbing of 11-year-old Houston boy","author":"JUAN A. LOZANO Associated Press","content":"HOUSTON -- A man was convicted Tuesday in the fatal stabbing of an 11-year-old Houston boy as the child walked home from school in 2016.\r\nJurors deliberated for about three hours before finding 33-ye… [+2281 chars]"},"18":{"publishedAt":"2022-05-03T21:05:25Z","title":"Politico's Supreme Court scoop boosts security concerns","author":"DAVID BAUDER AP Media Writer","content":"NEW YORK -- In breaking news of a Supreme Court draft opinion that would strike down 50 years of abortion policy, Politico's most impactful moment also put the news organization squarely in the middl… [+4450 chars]"},"19":{"publishedAt":"2022-05-03T21:04:30Z","title":"Man convicted in $60M film finance fraud scheme","author":"The Associated Press","content":"FORT LAUDERDALE, Fla. -- An Oklahoma man claiming to be a film financier was convicted Tuesday in South Florida of participating in a scheme to steal more than $60 million from investors and producer… [+1538 chars]"},"20":{"publishedAt":"2022-05-03T20:56:51Z","title":"LinkedIn settles with U.S. over alleged pay discrimination","author":"The Associated Press","content":"SAN FRANCISCO -- The career-networking service LinkedIn has agreed to pay $1.8 million in back wages to hundreds of female workers to settle a pay discrimination complaint brought by U.S. labor inves… [+1012 chars]"},"21":{"publishedAt":"2022-05-03T20:52:41Z","title":"Norman Mineta, transportation secretary in 9\/11 era, dies","author":"The Associated Press","content":"ANNAPOLIS, Md. -- Norman Mineta, who broke racial barriers for Asian Americans serving in high-profile government posts and ordered commercial flights grounded after the 9\/11 terror attacks as the na… [+5672 chars]"},"22":{"publishedAt":"2022-05-03T20:43:41Z","title":"Florida woman guilty in nightclub shooting that killed 2","author":"The Associated Press","content":"FORT MYERS, Fla. -- A Florida woman was convicted Tuesday for her part in a 2016 Florida nightclub shooting that left two teenagers dead and 14 other people injured.\r\nA Lee County jury found Kierra K… [+898 chars]"},"23":{"publishedAt":"2022-05-03T20:37:11Z","title":"Airbnb posts much smaller Q1 loss, revenue doubles from 2021","author":"The Associated Press","content":"Airbnb sharply narrowed its first-quarter loss to $19 million, as the rebound in travel after two years of pandemic caused bookings to jump and revenue to nearly double from a year ago.\r\nThe lodging-… [+761 chars]"},"24":{"publishedAt":"2022-05-03T20:31:26Z","title":"In Nigeria, UN chief welcomes reintegration of extremists","author":"CHINEDU ASADU Associated Press","content":"MAIDUGURI, Nigeria -- United Nations Secretary-General Antonio Guterres on Tuesday lauded Nigerian authorities ongoing reintegration of defectors from the jihadi Boko Haram group, which has waged a d… [+2807 chars]"},"25":{"publishedAt":"2022-05-03T20:29:40Z","title":"How major US stock indexes fared Tuesday","author":"The Associated Press","content":"Stocks closed modestly higher on Wall Street Tuesday as investors await Wednesdays decision by the Federal Reserve on interest rates.\r\nThe S&amp;P 500, the Dow Jones Industrial Average and the Nasdaq… [+992 chars]"},"26":{"publishedAt":"2022-05-03T20:19:26Z","title":"Photographer Ron Galella, sued by Jackie Onassis, dead at 91","author":"KAREN MATTHEWS Associated Press","content":"NEW YORK -- Ron Galella, the photographer known for his visceral celebrity shots and his dogged pursuit of Jacqueline Kennedy Onassis, who sued him and won a restraining order, has died at age 91.\r\nG… [+1737 chars]"},"27":{"publishedAt":"2022-05-03T20:17:55Z","title":"BP, Clorox rise; Chegg, Expedia fall","author":"The Associated Press","content":"NEW YORK -- Stocks that traded heavily or had substantial price changes Tuesday:\r\nDevon Energy Corp., up $5.93 to $64.28.\r\nThe oil and gas exploration company reported strong first-quarter earnings a… [+1072 chars]"},"28":{"publishedAt":"2022-05-03T20:16:56Z","title":"Ukrainian band teams up with Ed Sheeran for charity single","author":"LOUISE DIXON Associated Press","content":"LONDON -- The sirens interrupted our sleep, grabbed in two suitcases everything that is in the past, then go! sings Antytila frontman Taras Topolia on the Ukrainian bands new collaboration with Ed Sh… [+2595 chars]"},"29":{"publishedAt":"2022-05-03T20:16:26Z","title":"Starbucks reports record Q2 sales as costs climb","author":"DEE-ANN DURBIN AP Business Writer","content":"Starbucks sales climbed to record levels in its fiscal second quarter, but its profits took a hit from climbing labor and ingredient costs.\r\nThe Seattle coffee company which welcomed back former CEO … [+946 chars]"},"30":{"publishedAt":"2022-05-03T20:12:42Z","title":"Norman Mineta, 1st Asian-American Cabinet secretary, dies","author":"The Associated Press","content":"ANNAPOLIS, Md. -- Norman Mineta, who as federal transportation secretary ordered commercial flights grounded after the 9\/11 terror attacks in 2001, died Tuesday. He was 90.\r\nJohn Flaherty, Minetas fo… [+453 chars]"},"31":{"publishedAt":"2022-05-03T20:05:44Z","title":"Summon the Suit with Products Inspired by ‘Moon Knight’","author":"Melissa Lee","content":"Wow! I cant believe weve already reached the season finale of Moon Knight starring Oscar Issac and Ethan Hawke. The thrilling new series follows Steven Grant (Oscar Issac), a mild-mannered gift-shop … [+2471 chars]"},"32":{"publishedAt":"2022-05-03T20:04:42Z","title":"Norman Mineta, who as federal transportation secretary ordered flights grounded after 9\/11 terror attacks, has died.","author":"The Associated Press","content":"ANNAPOLIS, Md. -- Norman Mineta, who as federal transportation secretary ordered flights grounded after 9\/11 terror attacks, has died."},"33":{"publishedAt":"2022-05-03T19:50:24Z","title":"What is Roe v. Wade, the landmark abortion access case?","author":"TRAVIS LOLLER Associated Press","content":"A leaked draft of a U.S. Supreme Court decision suggests the country's highest court could be poised to overturn the constitutional right to abortion, allowing individual states to more heavily regul… [+3764 chars]"},"34":{"publishedAt":"2022-05-03T19:50:15Z","title":"Closing prices for crude oil, gold and other commodities","author":"The Associated Press","content":"Benchmark U.S. crude oil for June delivery fell $2.76 to $102.41 a barrel Tuesday. Brent crude for July delivery fell $2.61 to $104.97 a barrel.\r\nWholesale gasoline for June delivery fell 1 cent to $… [+379 chars]"},"35":{"publishedAt":"2022-05-03T19:45:09Z","title":"Who leaked Supreme Court draft opinion on abortion?","author":"Brad Mielke, Haley Yamada","content":"A draft of the SCOTUS decision on the Mississippi case that challenges Roe v. Wade was leaked Monday night, first reported by Politico. According to the copy of the draft opinion for the majority, a … [+4388 chars]"},"36":{"publishedAt":"2022-05-03T19:44:43Z","title":"Jon Yaged to succeed Don Weisberg as Macmillan CEO","author":"The Associated Press","content":"NEW YORK -- The CEO of Macmillan Publishers, Don Weisberg, will step down at the end of the year. Jon Yaged, currently the company's president, will succeed him.\r\n\"I can, without hesitation, say that… [+1408 chars]"},"37":{"publishedAt":"2022-05-03T19:31:46Z","title":"US to hold back Lake Powell water to protect hydropower","author":"SAM METZ Associated Press","content":"SALT LAKE CITY -- U.S. officials announced plans Tuesday that they characterized as extraordinary to keep hundreds of billions of gallons of water stored in a reservoir on the Utah-Arizona line to pr… [+4406 chars]"},"38":{"publishedAt":"2022-05-03T19:31:22Z","title":"Man charged in ISIS-inspired plot found mentally competent","author":"MICHAEL KUNZELMAN Associated Press","content":"COLLEGE PARK, Md. -- A Maryland man has become mentally competent to stand trial more than two years after he was charged with planning an Islamic State-inspired attack at a shopping and entertainmen… [+2968 chars]"},"39":{"publishedAt":"2022-05-03T19:30:10Z","title":"Cast Enjoy Electric Nights of Fun as Disneyland Resort Celebrates Return of Nighttime Spectaculars","author":"Lisa Greathouse","content":"Thousands of Disneyland Resort cast members celebrated the long-awaited return of nighttime spectaculars over two consecutive nights of cast-exclusive events that featured dancing, treats, photo ops … [+3055 chars]"},"40":{"publishedAt":"2022-05-03T19:23:41Z","title":"Change trains: Mexico favors N. Mexico over Texas","author":"MARK STEVENSON Associated Press","content":"MEXICO CITY -- The Mexican government is snubbing Texas and moving a proposed border rail link to New Mexico after Texas Gov. Greg Abbott backed up border crossings with state inspections in April.\r\n… [+2815 chars]"},"41":{"publishedAt":"2022-05-03T19:20:26Z","title":"Teen appeared to fall out of Florida ride halfway in plunge","author":"MIKE SCHNEIDER Associated Press","content":"ORLANDO, Fla. -- A 14-year-old Missouri boy who fell to his death from a 430-foot (130-meter) drop-tower ride in central Florida's tourist district appeared to slip out of his seat at the halfway mar… [+2551 chars]"},"42":{"publishedAt":"2022-05-03T18:43:12Z","title":"US abortion trends have changed since landmark 1973 ruling","author":"LINDSEY TANNER AP Medical Writer","content":"The abortion landscape has changed in the United States since the Supreme Courts Roe v. Wade decision in 1973. A leaked draft of a Supreme Court decision suggests a majority of justices support throw… [+1920 chars]"},"43":{"publishedAt":"2022-05-03T18:42:45Z","title":"\"Still in shock:\" abortion defenders, foes stunned by leak","author":"REBECCA SANTANA, CLAIRE GALOFARO and EMILY WAGSTER PETTUS Associated Press","content":"The owner of an Alabama abortion clinic was flying home from a conference with other abortion providers Monday night when a leaked Supreme Court draft opinion began ricocheting around the world.\r\nAs … [+6121 chars]"},"44":{"publishedAt":"2022-05-03T18:40:29Z","title":"Trump will repay $750K to settle inauguration lawsuit over hotel payments","author":"Katherine Faulders, John Santucci","content":"The Trump Organization and Donald Trump's presidential inaugural committee have agreed to settle a lawsuit brought by Washington, D.C., Attorney General Karl Racine over allegations that Trump and hi… [+1660 chars]"},"45":{"publishedAt":"2022-05-03T18:37:57Z","title":"The top 10 movies on the Apple Store","author":"The Associated Press","content":"Movies US charts:\r\n1. Uncharted\r\n2. Spider-Man: No Way Home\r\n3. Moonfall\r\n4. Ambulance\r\n5. Sing 2\r\n6. The Batman\r\n7. Jackass Forever\r\n8. Dog (2022)\r\n9. Infinite\r\n10. Marry Me (2022)\r\nMovies US charts… [+265 chars]"},"46":{"publishedAt":"2022-05-03T18:34:56Z","title":"Apple-Apps-Top-10","author":"The Associated Press","content":"Top Paid iPhone Apps:\r\n1. Minecraft, Mojang\r\n2. Rovio Classics: Angry Birds, Rovio Entertainment Oyj\r\n3. Geometry Dash, RobTop Games AB\r\n4. Bloons TD 6, Ninja Kiwi\r\n5. HotSchedules, HotSchedules\r\n6. … [+1380 chars]"},"47":{"publishedAt":"2022-05-03T18:30:12Z","title":"Cops: Body in barrel in Lake Mead was man who had been shot","author":"The Associated Press","content":"LAS VEGAS -- The body found inside a barrel in the newly exposed bottom of Lake Mead after the lake's level was depleted amid drought is that a man who was shot, police said Tuesday.\r\nThe killing pro… [+874 chars]"},"48":{"publishedAt":"2022-05-03T18:28:31Z","title":"Mexico relocates migrant camp; Haitians appear at border","author":"MARÍA VERZA Associated Press","content":"MEXICO CITY -- Mexican authorities said Tuesday they have relocated a migrant camp that sprung up in a park in the border city of Reynosa, moving about 2,000 people from Central American and Haiti to… [+2628 chars]"},"49":{"publishedAt":"2022-05-03T18:16:26Z","title":"Bond denied for former 'American Idol' star charged in crash","author":"The Associated Press","content":"SPARTANBURG, S.C. -- A South Carolina judge has denied bond for a former American Idol contestant accused of killing a man by barreling into him with his pickup truck after using a marijuana vaping d… [+1846 chars]"},"50":{"publishedAt":"2022-05-03T18:16:11Z","title":"Condors soar again over Northern California coastal redwoods","author":"The Associated Press","content":"REDWOOD NATIONAL PARK, Calif. -- The endangered California condor returned to soar the skies over the state's far northern coast redwood forests on Tuesday for the first time in more than a century.\r… [+2815 chars]"},"51":{"publishedAt":"2022-05-03T18:08:41Z","title":"CDC restates recommendation for masks on planes, trains","author":"MIKE STOBBE AP Medical Writer","content":"NEW YORK -- U.S. health officials on Tuesday restated their recommendation that Americans wear masks on planes, trains and buses, despite a court ruling last month that struck down a national mask ma… [+1098 chars]"},"52":{"publishedAt":"2022-05-03T18:04:47Z","title":"Key moments in Blac Chyna's trial against Kardashians","author":"ANDREW DALTON AP Entertainment Writer","content":"LOS ANGELES -- To keep up with the Kardashians for the past two weeks, you would've had to spend a lot of time at a downtown Los Angeles courthouse, where they've been watching and testifying at a tr… [+5823 chars]"},"53":{"publishedAt":"2022-05-03T18:03:35Z","title":"Yazidis, displaced again, fear more strife in Iraqi homeland","author":"RASHID YAHYA and SAMYA KULLAB Associated Press","content":"ZAKHO, Iraq -- Iraqis in a northern town still traumatized by memories of the Islamic State group feared more violence Tuesday after hostilities between the military and a local militia erupted, peop… [+3174 chars]"},"54":{"publishedAt":"2022-05-03T17:51:41Z","title":"Sri Lanka opposition declares no confidence in government","author":"KRISHAN FRANCIS Associated Press","content":"COLOMBO, Sri Lanka -- Sri Lankas main opposition party on Tuesday issued a no-confidence declaration aiming at ousting Prime Minister Mahinda Rajapaksa and his Cabinet and blaming them of failing in … [+2327 chars]"},"55":{"publishedAt":"2022-05-03T17:35:29Z","title":"Disneyland Resort and Make-A-Wish Fulfill First Official In-Park Wishes Since Reopening","author":"Krystal Rhaburn","content":"This World Wish Day, we announced that the Disneyland Resort Wish Program is returning after a two-year hiatus! Since the very first official wish was granted at Disneyland Resort in 1980, Disney and… [+2869 chars]"},"56":{"publishedAt":"2022-05-03T17:21:42Z","title":"Depp libel suit moves ahead against Heard after resting case","author":"MATTHEW BARAKAT Associated Press","content":"FALLS CHURCH, Va. -- A judge on Tuesday let Johnny Depp move forward with his libel suit against his ex-wife, Amber Heard, after the Pirates of the Caribbean star rested his case.\r\nHeard's lawyers ha… [+2743 chars]"},"57":{"publishedAt":"2022-05-03T17:14:26Z","title":"Change at the top for Biogen after Alzheimer's drug flops","author":"MATTHEW PERRONE and TOM MURPHY","content":"The Associated Press -- Biogen will replace its CEO and largely abandon marketing of its controversial Alzheimer's drug Aduhelm less than a year after the medication's launch triggered a backlash fro… [+3445 chars]"},"58":{"publishedAt":"2022-05-03T17:12:26Z","title":"Pfizer hopes to submit little-kid vaccine data by early June","author":"The Associated Press","content":"Pfizer now hopes to tell U.S. regulators how well its COVID-19 vaccine works in the littlest kids by late May or early June.\r\nPfizer is testing three extra-small doses of its vaccine in children unde… [+1008 chars]"},"59":{"publishedAt":"2022-05-03T17:11:53Z","title":"Cops hold courthouse rally for trooper arraigned in killing of alleged teen carjacker","author":"Bill Hutchinson, Deena Zaru, Keara Shannon","content":"Dozens of police officers from multiple states held a rally outside a Connecticut courthouse Tuesday as a white state trooper they contend was charged with manslaughter for doing his job was arraigne… [+5012 chars]"},"60":{"publishedAt":"2022-05-03T17:02:26Z","title":"'Melrose Place' actress loses bid to reduce crash sentence","author":"The Associated Press","content":"TRENTON, N.J. -- An actor who appeared in the 1990s prime-time soap opera Melrose Place has lost a bid to have her sentence in a 2010 fatal auto crash reduced.\r\nAn appeals court in New Jersey rejecte… [+1621 chars]"},"61":{"publishedAt":"2022-05-03T16:51:21Z","title":"Brittney Griner 'wrongfully detained' in Russia: State Department","author":"Deena Zaru, Shannon K. Crawford","content":"The U.S. government now considers WNBA star Brittney Griner to be wrongfully detained in Russia, the State Department said.\r\nThe welfare and safety of U.S. citizens abroad is among the highest priori… [+4037 chars]"},"62":{"publishedAt":"2022-05-03T16:51:04Z","title":"Collins hits Kavanaugh, Gorsuch after leaked Supreme Court draft opinion on abortion","author":"Alexandra Hutzler, Trish Turner, Allison Pecorin, Benjamin Siegel","content":"With the bombshell leak of a draft Supreme Court opinion indicating a reported majority of conservative justices is ready to overturn Roe v. Wade, all eyes were once again on Republican Sen. Susan Co… [+4393 chars]"},"63":{"publishedAt":"2022-05-03T16:50:07Z","title":"Missing inmate, corrections officer had 'special relationship': Sheriff","author":"Emily Shapiro","content":"The corrections officer and escaped murder suspect who have been missing for days had \"a special relationship,\" the local sheriff confirmed.\r\nInmate Casey White and Lauderdale County Assistant Direct… [+2177 chars]"},"64":{"publishedAt":"2022-05-03T16:20:41Z","title":"Ethiopia detains 76 over Eid al-Fitr prayer unrest","author":"Associated Press","content":"NAIROBI, Kenya -- Ethiopian officials say they have arrested 76 suspects following unrest that erupted in the capital, Addis Ababa, during Eid al-Fitr prayers on Monday.\r\nThe unrest followed days of … [+2286 chars]"},"65":{"publishedAt":"2022-05-03T16:15:41Z","title":"Dominican diplomat apparently kidnapped in Haiti","author":"The Associated Press","content":"SANTO DOMINGO, Dominican Republic -- A diplomat from the Dominican Republic apparently has been kidnapped in neighboring Haiti, prompting Dominican authorities to call for his safe release.\r\nThe loca… [+821 chars]"},"66":{"publishedAt":"2022-05-03T16:09:11Z","title":"Minnesota appeals court: Trump flag protected free speech","author":"The Associated Press","content":"BUFFALO, Minn. -- The Minnesota Court of Appeals has sided with a man who said he shouldn't have been fined for flying a huge Donald Trump flag atop a crane over his business, calling it a protected … [+1263 chars]"},"67":{"publishedAt":"2022-05-03T16:07:36Z","title":"Man who assaulted flight attendants, duct taped on Frontier flight, sentenced to jail","author":"Sam Sweeney","content":"A 23-year-old man featured in a video that went viral after he groped two flight attendants, punched a third, screamed his parents had $2 million and was duct taped to a seat of a Frontier Airlines f… [+2167 chars]"},"68":{"publishedAt":"2022-05-03T16:05:39Z","title":"With Supreme Court poised to reverse Roe, most support abortion rights: POLL","author":"Christine Filer","content":"Amid reports of a draft Supreme Court opinion that would overturn Roe v. Wade, an ABC News\/Washington Post poll finds that majorities of Americans support upholding Roe, say abortion should be legal … [+5655 chars]"},"69":{"publishedAt":"2022-05-03T16:02:32Z","title":"UN: Obesity levels in Europe at 'epidemic proportions'","author":"The Associated Press","content":"LONDON -- The World Health Organization says the rates of people who are obese and overweight in Europe have hit epidemic proportions,\" with nearly 60% of adults and a third of children in one of tho… [+1793 chars]"},"70":{"publishedAt":"2022-05-03T16:00:51Z","title":"More Galactic Experiences Landing at Disneyland Resort in Celebration of Star Wars Day (and Beyond!)","author":"Gabriel Gibaldi","content":"Fans of a galaxy far, far away will discover additional, limited-time experiences, character encounters, photo opportunities and more this May and June throughout Disneyland Resort. It all adds to th… [+5150 chars]"},"71":{"publishedAt":"2022-05-03T15:58:22Z","title":"Gov. Hogan urges voters to 'stand against the extremes'","author":"BRIAN WITTE Associated Press","content":"ANNAPOLIS, Md. -- Maryland Gov. Larry Hogan is urging Republican voters to stand against the extremes, saying the GOP is \"desperately in need of a course correction, as the term-limited governor weig… [+2283 chars]"},"72":{"publishedAt":"2022-05-03T15:56:33Z","title":"Biden reacts to leaked draft Supreme Court opinion on abortion","author":"Libby Cathey","content":"President Joe Biden weighed in Tuesday morning on the leaked draft Supreme Court opinion showing the panel's conservative majority of justices is poised to overturn nearly 50 years of established abo… [+4067 chars]"},"73":{"publishedAt":"2022-05-03T15:53:36Z","title":"Chief Justice Roberts responds to leaked Supreme Court draft opinion","author":"Devin Dwyer, Libby Cathey","content":"The Supreme Court and Chief Justice John Roberts put out rare, written statements Tuesday to address the leak of a draft opinion showing the panel's conservative majority of justices is poised to ove… [+1369 chars]"},"74":{"publishedAt":"2022-05-03T15:49:56Z","title":"Schumer vows abortion law vote, but not filibuster changes","author":"LISA MASCARO AP Congressional Correspondent","content":"WASHINGTON -- Senate Majority Leader Chuck Schumer angrily denounced as an abomination the Supreme Courts leaked draft decision that would overturn the nations landmark Roe v. Wade law and vowed that… [+4677 chars]"},"75":{"publishedAt":"2022-05-03T15:47:15Z","title":"Nigerian president says hostages being used as human shields","author":"CHINEDU ASADU Associated Press","content":"MAIDUGURI, Nigeria -- Dozens of passengers kidnapped five weeks ago from a train near Nigerias capital are being used as human shields by their abductors, President Muhammadu Buhari said.\r\nMore than … [+2244 chars]"},"76":{"publishedAt":"2022-05-03T15:42:54Z","title":"Nation reacts to leaked draft Supreme Court decision that could overturn Roe v. Wade","author":"Morgan Winsor","content":"Politicians and organizations are reacting to an unprecedented leaked draft opinion suggesting the U.S. Supreme Court could be poised to overturn the landmark Roe v. Wade case that legalized abortion… [+3985 chars]"},"77":{"publishedAt":"2022-05-03T15:20:45Z","title":"In Mexico, an entire town has its cross to bear","author":"FERNANDA PESCE Associated Press","content":"SANTA CRUZ XOCHITEPEC -- Dozens of men strained and struggled as they hefted a huge cross adorned with colorful ribbons and trudged down a steep hill in a yearly ceremony of the Day of the Cross cele… [+1960 chars]"},"78":{"publishedAt":"2022-05-03T15:17:55Z","title":"Florida rapper Rod Wave arrested on outstanding warrant","author":"The Associated Press","content":"ST. PETERSBURG, Fla. -- A 23-year-old Florida rapper who goes by the name Rod Wave has been arrested on a domestic battery charge, officials said.\r\nRodarius Green, whose song Heart on Ice broke the B… [+783 chars]"},"79":{"publishedAt":"2022-05-03T15:13:33Z","title":"Nonprofits likely under fire as Senate explores ‘dark money’","author":"DAN PARKS of The Chronicle of Philanthropy Chronicle of Philanthropy","content":"A Senate hearing on Wednesday is likely to produce fireworks as Republicans and Democrats square off over the role that foundations and nonprofits are playing in elections.\r\nThe Senate Finance subcom… [+5425 chars]"},"80":{"publishedAt":"2022-05-03T15:11:27Z","title":"EXPLAINER: What's the latest in Russia's dance with default?","author":"The Associated Press","content":"Russia appeared to dodge default on its foreign debt by dipping into its scarce dollar reserves. But Moscow's debt drama is far from over.\r\nRussia's finance ministry abandoned its proposal to use rub… [+5893 chars]"},"81":{"publishedAt":"2022-05-03T15:11:12Z","title":"EXPLAINER: What's the latest in Russia's dance with default?","author":"The Associated Press","content":"Russia appeared to dodge default on its foreign debt by dipping into its scarce dollar reserves. But Moscow's debt drama is far from over.\r\nRussia's finance ministry abandoned its proposal to use rub… [+5893 chars]"},"82":{"publishedAt":"2022-05-03T15:09:41Z","title":"Review: In 'Happening,' a riveting abortion drama","author":"JAKE COYLE AP Film Writer","content":"Happening, Audrey Diwan's Golden Lion-winner at last year's Venice Film Festival, is set in 1963 France but the period detail isn't prominent. Instead, it's an abortion tale that feels as though it c… [+3111 chars]"},"83":{"publishedAt":"2022-05-03T15:04:32Z","title":"Powerful French abortion drama ‘Happening’ lands in US","author":"LINDSEY BAHR AP Film Writer","content":"Its 1963 in France and Anne is an ambitious, 23-year-old college student who becomes pregnant. She doesn't want to be. She's not ready to be a mother. But abortion isnt legal in the country and wont … [+5211 chars]"},"84":{"publishedAt":"2022-05-03T15:03:34Z","title":"Feinstein, Midori, Perlman headline Carnegie Ukraine benefit","author":"The Associated Press","content":"NEW YORK -- Singer Michael Feinstein, violinists Itzhak Perlman and Midori, and pianist Evgeny Kissin will perform at a Carnegie Hall benefit concert for Ukraine on May 23.\r\nSoprano Angel Blue, mezzo… [+569 chars]"},"85":{"publishedAt":"2022-05-03T14:42:58Z","title":"Report: Supreme Court draft suggests Roe could be overturned","author":"MARK SHERMAN and ZEKE MILLER Associated Press","content":"WASHINGTON -- A draft opinion suggests the U.S. Supreme Court could be poised to overturn the landmark 1973 Roe v. Wade case that legalized abortion nationwide, according to a Politico report.\r\nA dec… [+8239 chars]"},"86":{"publishedAt":"2022-05-03T14:33:41Z","title":"DC reaches $750K settlement in Trump inaugural lawsuit","author":"MICHAEL BALSAMO Associated Press","content":"WASHINGTON -- The District of Columbia attorney general said Tuesday that his office had reached a $750,000 settlement to resolve a lawsuit that alleged former President Donald Trumps inaugural commi… [+2140 chars]"},"87":{"publishedAt":"2022-05-03T14:29:12Z","title":"Cast of Broadway's 'Spring Awakening' reunite and reminisce","author":"MARK KENNEDY AP Entertainment Writer","content":"NEW YORK -- While many of John Gallagher Jr.'s peers went to college, he didn't. His university became Spring Awakening.\r\nGallagher spent much of what would have been his prime college years from 20 … [+5575 chars]"},"88":{"publishedAt":"2022-05-03T14:25:25Z","title":"Iran gets opportunity to sell auto parts to Russian carmaker","author":"The Associated Press","content":"TEHRAN, Iran -- A member of Irans syndicate of car parts producers says Iranian producers have an opportunity to export their wares to a Russian manufacturer, state media reported.\r\nThe late Monday r… [+1155 chars]"},"89":{"publishedAt":"2022-05-03T14:18:25Z","title":"Employers post record 11.5 million job openings in March","author":"PAUL WISEMAN AP Economics Writer","content":"WASHINGTON -- Employers posted a record 11.5 million job openings in March, more evidence of a tight labor market that has emboldened millions of American workers to seek better paying jobs and contr… [+1898 chars]"},"90":{"publishedAt":"2022-05-03T14:18:10Z","title":"Employers post record 11.5 million job openings in March","author":"PAUL WISEMAN AP Economics Writer","content":"WASHINGTON -- Employers posted a record 11.5 million job openings in March, more evidence of a tight labor market that has emboldened millions of American workers to seek better paying jobs and contr… [+1898 chars]"},"91":{"publishedAt":"2022-05-03T14:14:37Z","title":"Live updates | Biden blasts court's abortion draft ruling","author":"The Associated Press","content":"WASHINGTON -- WASHINGTON President Joe Biden says the basic fairness and the stability of our law demand that the U.S. Supreme Court not overturn the landmark 1973 Roe v. Wade case that legalized abo… [+2146 chars]"},"92":{"publishedAt":"2022-05-03T14:11:43Z","title":"German authorities probing man's death during police check","author":"The Associated Press","content":"BERLIN -- Authorities in Germany are probing the death of a man who collapsed Monday during a police check in the city of Mannheim, drawing allegations of police violence after a video surfaced alleg… [+942 chars]"},"93":{"publishedAt":"2022-05-03T14:09:12Z","title":"Biden reacts to apparent draft Supreme Court opinion on abortion","author":"Libby Cathey","content":"President Joe Biden weighed in Tuesday morning on the apparent draft Supreme Court opinion showing the panel's conservative majority of justices is poised to overturn nearly 50 years of established a… [+3137 chars]"},"94":{"publishedAt":"2022-05-03T14:01:33Z","title":"Biden to visit Lockheed plant as weapons stockpile strained","author":"AAMER MADHANI and BEN FOX Associated Press","content":"WASHINGTON -- When President Joe Biden on Tuesday visits a Lockheed Martin plant that manufactures an antitank weapons system, hes certain to herald the U.S.-made arms as a gamechanger for Ukraines s… [+4920 chars]"},"95":{"publishedAt":"2022-05-03T14:00:57Z","title":"Announcing New 2023 Adventures by Disney Itineraries: Sicily and the British Isles","author":"Melody Vagnini","content":"Wondering where to book your next trip? Better add two more options to your list, because we just announced our exciting lineup of Adventures by Disney itineraries for 2023, including the brand-new S… [+5930 chars]"},"96":{"publishedAt":"2022-05-03T13:59:30Z","title":"Review: 'Doctor Strange 2’ gets weirder, scarier, messier","author":"LINDSEY BAHR AP Film Writer","content":"Once a superhero franchise goes multiverse, its hard to go back.\r\nNo work of fiction ever needs permission to break the rules or push the boundaries of traditional storytelling, but the multiverse, a… [+4476 chars]"},"97":{"publishedAt":"2022-05-03T13:51:11Z","title":"Spain govt says it has nothing to hide in spyware scandals","author":"The Associated Press","content":"MADRID -- Spains government said Tuesday it had nothing to hide amid mounting unease over national security controversies involving Pegasus spyware, including the hacking of the prime minister's cell… [+3180 chars]"},"98":{"publishedAt":"2022-05-03T13:23:57Z","title":"Draft opinion jolts Michigan, where abortion ban is on books","author":"DAVID EGGERT Associated Press","content":"LANSING, Mich. -- A draft opinion that suggests the U.S. Supreme Court could be poised to overturn the landmark Roe v. Wade decision reverberated in political battleground Michigan, where a near-tota… [+3364 chars]"},"99":{"publishedAt":"2022-05-03T13:18:07Z","title":"UN says convoy with 127 civilians from Mariupol steel plant and nearby town arrive in Ukrainian-controlled city","author":"The Associated Press","content":"ZAPORIZHZHIA, Ukraine -- UN says convoy with 127 civilians from Mariupol steel plant and nearby town arrive in Ukrainian-controlled city."}}